/*
* Замінив назви змінних на більш зрозумілі та описові.
* Додав константи, такі як BOARD_SIZE, замість використання магічних чисел.
* Виніс перевірку кожної лінії в окремий метод checkLine.
* Спрощено метод checkVictory.
* Логіка роботи циклів була оптимізована через використання логічних змінних (validMove, gameFinished)
  замість використання декількох break або continue.
* Перевірив і відкоригував форматування коду відповідно до стандартів.
* Збільшив читабельність коду через додаткову структуру методів.
* Скоротив кількість дубльованих умов для перевірки перемоги.
* Оптимізував цикли шляхом винесення загальної логіки в окремі методи.
* Проаналізував проект з використанням SonarLint.
*/

public class App {
    public static void main(String[] args) {
        Game game = new Game();
        game.start();
    }
}
